#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_firewall.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01]
google_compute_health_check.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01]
google_compute_global_address.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01]
google_compute_instance.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01]
google_compute_instance_group.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01]
google_compute_backend_service.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01]
google_compute_url_map.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01]
google_compute_target_http_proxy.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01]
google_compute_global_forwarding_rule.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_global_forwarding_rule.this has been changed
  ~ resource "google_compute_global_forwarding_rule" "this" {
        id                    = "projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01"
      + labels                = {}
        name                  = "xlb-poc01"
        # (8 unchanged attributes hidden)
    }
  # google_compute_backend_service.this has been changed
  ~ resource "google_compute_backend_service" "this" {
      + custom_request_headers          = []
      + custom_response_headers         = []
      ~ health_checks                   = [
          + "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01",
          - "projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01",
        ]
        id                              = "projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01"
        name                            = "xlb-poc01"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_firewall.this has been changed
  ~ resource "google_compute_firewall" "this" {
        id                      = "projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01"
        name                    = "xlb-poc01"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
      + target_tags             = []
        # (9 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # google_compute_instance_group.this has been changed
  ~ resource "google_compute_instance_group" "this" {
        id        = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01"
      ~ instances = [
          + "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01",
          - "projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01",
        ]
        name      = "xlb-poc01"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_instance.this has been changed
  ~ resource "google_compute_instance" "this" {
        id                      = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01"
      + labels                  = {}
      + metadata                = {}
        name                    = "xlb-poc01"
      + resource_policies       = []
      + tags                    = []
        # (15 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_backend_service.this must be replaced
-/+ resource "google_compute_backend_service" "this" {
      - affinity_cookie_ttl_sec         = 0 -> null
      ~ creation_timestamp              = "2021-11-06T15:50:49.256-07:00" -> (known after apply)
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      ~ fingerprint                     = "9p7hxWpqTzQ=" -> (known after apply)
      ~ health_checks                   = [
          - "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01",
        ] -> (known after apply)
      ~ id                              = "projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01" -> (known after apply)
      ~ name                            = "xlb-poc01" -> "xlb-poc02" # forces replacement
      ~ port_name                       = "xlb-poc01" -> "xlb-poc02"
      ~ project                         = "playground-s-11-28ca33cd" -> (known after apply)
      ~ self_link                       = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01" -> (known after apply)
      ~ session_affinity                = "NONE" -> (known after apply)
      ~ timeout_sec                     = 30 -> (known after apply)
        # (3 unchanged attributes hidden)

      - backend {
          - balancing_mode               = "UTILIZATION" -> null
          - capacity_scaler              = 1 -> null
          - group                        = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01" -> null
          - max_connections              = 0 -> null
          - max_connections_per_endpoint = 0 -> null
          - max_connections_per_instance = 0 -> null
          - max_rate                     = 0 -> null
          - max_rate_per_endpoint        = 0 -> null
          - max_rate_per_instance        = 0 -> null
          - max_utilization              = 0 -> null
        }
      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_firewall.this must be replaced
-/+ resource "google_compute_firewall" "this" {
      ~ creation_timestamp      = "2021-11-06T15:49:00.808-07:00" -> (known after apply)
      ~ destination_ranges      = [] -> (known after apply)
      ~ direction               = "INGRESS" -> (known after apply)
      - disabled                = false -> null
      + enable_logging          = (known after apply)
      ~ id                      = "projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01" -> (known after apply)
      ~ name                    = "xlb-poc01" -> "xlb-poc02" # forces replacement
      ~ network                 = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/networks/default" -> "default"
      ~ project                 = "playground-s-11-28ca33cd" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01" -> (known after apply)
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null
        # (2 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # google_compute_global_address.this must be replaced
-/+ resource "google_compute_global_address" "this" {
      ~ address            = "34.149.130.125" -> (known after apply)
      - address_type       = "EXTERNAL" -> null
      ~ creation_timestamp = "2021-11-06T15:49:09.861-07:00" -> (known after apply)
      ~ id                 = "projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01" -> (known after apply)
      ~ name               = "xlb-poc01" -> "xlb-poc02" # forces replacement
      - prefix_length      = 0 -> null
      ~ project            = "playground-s-11-28ca33cd" -> (known after apply)
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01" -> (known after apply)
    }

  # google_compute_global_forwarding_rule.this must be replaced
-/+ resource "google_compute_global_forwarding_rule" "this" {
      ~ id                    = "projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01" -> (known after apply)
      ~ ip_address            = "projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01" -> (known after apply) # forces replacement
      ~ label_fingerprint     = "42WmSpB8rSM=" -> (known after apply)
      - labels                = {} -> null
      ~ name                  = "xlb-poc01" -> "xlb-poc02" # forces replacement
      + network               = (known after apply)
      ~ project               = "playground-s-11-28ca33cd" -> (known after apply)
      ~ self_link             = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01" -> (known after apply)
      ~ target                = "projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # google_compute_health_check.this must be replaced
-/+ resource "google_compute_health_check" "this" {
      ~ creation_timestamp  = "2021-11-06T15:49:53.005-07:00" -> (known after apply)
      ~ id                  = "projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01" -> (known after apply)
      ~ name                = "xlb-poc01" -> "xlb-poc02" # forces replacement
      ~ project             = "playground-s-11-28ca33cd" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01" -> (known after apply)
      ~ type                = "TCP" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ log_config {
          ~ enable = false -> (known after apply)
        }

      ~ tcp_health_check {
            # (2 unchanged attributes hidden)
        }
    }

  # google_compute_instance.this must be replaced
-/+ resource "google_compute_instance" "this" {
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01" -> (known after apply)
      ~ instance_id             = "2723819243868698696" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "CNq-uCnC9ug=" -> (known after apply)
      + min_cpu_platform        = (known after apply)
      ~ name                    = "xlb-poc01" -> "xlb-poc02" # forces replacement
      ~ project                 = "playground-s-11-28ca33cd" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                    = "us-central1-a" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/disks/xlb-poc01" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20211105" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/networks/default" -> "default"
          ~ network_ip         = "10.128.0.4" -> (known after apply)
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/regions/us-central1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "playground-s-11-28ca33cd" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "35.225.15.143" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance_group.this must be replaced
-/+ resource "google_compute_instance_group" "this" {
      ~ id        = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01" -> (known after apply)
      ~ instances = [
          - "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01",
        ] -> (known after apply)
      ~ name      = "xlb-poc01" -> "xlb-poc02" # forces replacement
      ~ network   = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/networks/default" -> (known after apply)
      ~ project   = "playground-s-11-28ca33cd" -> (known after apply)
      ~ self_link = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01" -> (known after apply)
      ~ size      = 1 -> (known after apply)
      ~ zone      = "us-central1-a" -> (known after apply)

      ~ named_port {
          ~ name = "xlb-poc01" -> "xlb-poc02"
            # (1 unchanged attribute hidden)
        }
    }

  # google_compute_target_http_proxy.this must be replaced
-/+ resource "google_compute_target_http_proxy" "this" {
      ~ creation_timestamp = "2021-11-06T15:51:21.785-07:00" -> (known after apply)
      ~ id                 = "projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01" -> (known after apply)
      ~ name               = "xlb-poc01" -> "xlb-poc02" # forces replacement
      ~ project            = "playground-s-11-28ca33cd" -> (known after apply)
      ~ proxy_bind         = false -> (known after apply)
      ~ proxy_id           = 3056667651551705094 -> (known after apply)
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01" -> (known after apply)
      ~ url_map            = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01" -> (known after apply)
    }

  # google_compute_url_map.this must be replaced
-/+ resource "google_compute_url_map" "this" {
      ~ creation_timestamp = "2021-11-06T15:51:10.556-07:00" -> (known after apply)
      ~ default_service    = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01" -> (known after apply)
      ~ fingerprint        = "7U_PmrEkKZ8=" -> (known after apply)
      ~ id                 = "projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01" -> (known after apply)
      ~ map_id             = 7001636838534985777 -> (known after apply)
      ~ name               = "xlb-poc01" -> "xlb-poc02" # forces replacement
      ~ project            = "playground-s-11-28ca33cd" -> (known after apply)
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01" -> (known after apply)
    }

Plan: 9 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Nevana, Action: `pull_request`*